frontend/modules/payments/models/Packregistration.php

INSERT INTO `inpayments` (`member`, `amount`, `pdate`, `pMethod`, `package`, `ptype`, `transactionNo`, `recordBy`, `recordDate`) VALUES (5, 50, '2020-12-12 16:50::07', 1, 1, 1, 'OL77AEYN4H', 5, '2020-12-12 16:50::07')
---
    public function keepValues(){
        $dbmodel = new Inpayments();
        $dbmodel->member= $this->member;
        $dbmodel->amount = $this->amount;
        $dbmodel->pdate = date('Y-m-d H:i::s');
        $dbmodel->pMethod = $this->pMethod;
        $dbmodel->package = $this->package;
        $dbmodel->ptype = $this->ptype;
        $dbmodel->transactionNo = $this->trxNo;
        $dbmodel->recordBy = Yii::$app->user->id;
        $dbmodel->recordDate = date('Y-m-d H:i::s');
        $dbmodel->save();