frontend/modules/dashboard/models/Membership.php

SELECT * FROM `people` `p` LEFT JOIN `user` `u` ON u.peopleId=p.id LEFT JOIN `sponsorship` `s` ON s.member=p.id LEFT JOIN `statuses` `t` ON t.id=s.status LEFT JOIN `ranks` `r` ON r.id=s.rank WHERE `u`.`id`=5
---
    public function init()
    {
        $myqry = (new \yii\db\Query())
                ->select('*')
                ->from('people p')
                ->leftJoin('user u','u.peopleId=p.id')
                 ->leftJoin('sponsorship s','s.member=p.id')
                 ->leftJoin('statuses t','t.id=s.status')
                ->leftJoin('ranks r', 'r.id=s.rank')
                ->where(['u.id'=>Yii::$app->user->id])
                ->one();

SELECT * FROM `sponsorship` `s` LEFT JOIN `people` `p` ON p.id= member LEFT JOIN `ranks` `r` ON r.id=s.rank WHERE (`level`=1) AND (`parent` IS NULL) ORDER BY `membershipNo`
---
    public function getLevelParts(){

        $extractIdx=0;// keeps track of total no of members
        $myqry = (new \yii\db\Query())
                ->from('sponsorship s')
                ->leftJoin('people p','p.id= member')
                ->leftJoin('ranks r', 'r.id=s.rank')
                ->orderBy(['membershipNo'=>SORT_ASC]);
        for( $i=0;$i<Yii::$app->params['maxLevels'];$i++ ){// $i keeps track of levels
            $relLevel=$i+1;
            $parentArr = $this->parents[$relLevel];
//

            if(count($parentArr)==0)break;//Stop if no more children
            $this->levelCount[$relLevel] = count($parentArr);
            $levelItems = $myqry->select('*')
                            ->where(['level'=> ($this->level)+$relLevel])
                            ->andWhere(['IN','parent',$parentArr])
                            ->all();