common/components/MemberDetails.php

    public function getMembersList(){
        $arr = (new \yii\db\Query())
                ->select(['member'])
                ->from('sponsorship')
                ->all();
---
SELECT `member` FROM `sponsorship`

    public function getProspectiveMembers()
    {
        $arr = (new \yii\db\Query())
                ->select(['id'])
                ->from('people')
                ->where(['NOT IN', 'id', $this->getMembersList()])
                ->all();
---
SELECT `id` FROM `people` WHERE `id`<>'1'

    public function getMemberPartsUsingPeopleId($peopleId,$optn=1)
    {
        $myqry = (new \yii\db\Query())
                ->select('*')
                ->from('sponsorship s')
                ->leftJoin('people p','p.id= member')
                ->leftJoin('ranks r', 'r.id=s.rank')
                ->where(['member'=> $peopleId])
                ->one();
---
SELECT * FROM `sponsorship` `s` LEFT JOIN `people` `p` ON p.id= member LEFT JOIN `ranks` `r` ON r.id=s.rank WHERE `member` IS NULL

    public function isRegistered($memberId,$optn=1) {
       $mycount = (new \yii\db\Query())
                ->select('*')
                ->from('inpayments i')

                ->where(['member'=>$memberId, 'ptype'=>1]);
       switch($optn){
           case 1:
                return $mycount->count();
---
SELECT COUNT(*) FROM `inpayments` `i` WHERE (`member`=2) AND (`ptype`=1)