backend/modules/geneology/models/People.php

SELECT * FROM `user` WHERE `peopleId`=2
---
    public function getFullNameAndEmail()
    {
        return  $this->firstName.' '.$this->surname.'; ('.$this->user->email.')';