frontend/modules/basic/components/UserDetails.php

SELECT * FROM `user` WHERE `id`=1
---
    public function getPersonId($id){
        $mymodel = User::findOne($id);