backend/modules/payments/controllers/InpaymentsController.php

    public function actionConfirmpay($memberId)
    {
        $memberdetails = Yii::$app->memberdetails;
        $model = Inpayments::find()->where(['member'=>$memberId])->one();
---
SELECT * FROM `inpayments` WHERE `member`='5'

    protected function findModel($id)
    {
        if (($model = Inpayments::findOne($id)) !== null) {
---
SELECT * FROM `inpayments` WHERE `id`='1'