frontend/modules/basic/models/People.php

SELECT * FROM `titles` WHERE `id`=1
---
    public function getFullName(){
        return $this->title->title.' ' .$this->firstName.( is_Null($this->otherNames)? ' ': ' '.$this->otherNames).' '.$this->surname;