backend/modules/payments/views/inpayments/confirmpay.php

    <h1><?= Html::encode($this->title) ?></h1>
        <div class="row">
        <div class="col-sm-6">
            <?= $form->field($model, 'member')->dropDownList(ArrayHelper::map(People::find()->all(), 'id', 'FullName'), ['disabled' => 'disabled']) ?>
        </div>
        <div class="col-sm-3">
            <?= $form->field($model, 'ptype')->dropDownList(ArrayHelper::map(Paymenttypes::find()->all(), 'id', 'ptypeName'), ['disabled' => 'disabled']) ?>
---
SELECT * FROM `people`
SELECT * FROM `paymenttypes`

    </div>
    <div class="row">
        <div class="col-sm-3">
            <?= $form->field($model, 'package')->dropDownList(ArrayHelper::map(Packages::find()->all(), 'id', 'packName'),['prompt'=> '--Select preferred Package--', 'disabled' => 'disabled']) ?>
        </div>
        <div class="col-sm-3">
            <?= $form->field($model, 'pMethod')->dropDownList(ArrayHelper::map(Paymethods::find()->all(), 'id', 'methodName'),['prompt'=>'--Select payment method--', 'disabled' => 'disabled']) ?>
---
SELECT * FROM `packages`
SELECT * FROM `paymethods`