backend/modules/geneology/views/sponsorship/_form.php

SELECT * FROM `people` WHERE `id` IN ('2', '3', '4', '5', '6')
---
    <?php $form = ActiveForm::begin(); ?>
    <div class="row">
        <div class="col-sm-2">
            <?= $form->field($model, 'member')->dropDownList(ArrayHelper::map(People::find()
                    ->where(['In','id',Yii::$app->memberdetails->getProspectiveMembers()])->all(), 'id', 'FullNameAndEmail'),['prompt'=>'Select Member']) ?>

SELECT * FROM `statuses`
---
            <?= Html::img('images/common/plussign.png', ['url' => 'basic/people/create', 'id' => 'addPerson', 'value' => '1', 'data-toggle' => "popover", 'title' => "Click to add a new member\'s details", 'disabled'=>$model->isNewRecord?null:'disabled']) ?>
        </div>
        <div class="col-sm-2">
            <?= $form->field($model, 'status')->dropDownList(ArrayHelper::map(Statuses::find()->all(), 'id', 'Status')) ?>

SELECT * FROM `people` WHERE `id`='1'
---
            <?= $form->field($model, 'membershipNo')->textInput(['disabled'=>'disabled']) ?>
        </div>
        <div class="col-sm-2">
            <?= $form->field($model, 'sponsor')->dropDownList(ArrayHelper::map(People::find()
                    ->where(['In','id',Yii::$app->memberdetails->getMembersList()])->all(), 'id', 'FullNameAndEmail'),['prompt'=>'Select Sponsor']) ?>
        </div>
        <div class="col-sm-2">
            <?= $form->field($model, 'parent')->dropDownList(ArrayHelper::map(People::find()
                    ->where(['In','id',Yii::$app->memberdetails->getMembersList()])->all(), 'id', 'FullNameAndEmail'),['prompt'=>'Select Parent']) ?>